/* У заданому тексті знайти кількість слів за умови, що між словами може бути будь-яка
 * кількість пропусків.
 * крч создаём массив букв
 * массив левых символов (цифры, спецсимволы)
 * делаем фор с длинной символов строки в виде ограничителя (что-то типо len.str(); если это возможно реализовать без библиотек)
 * 
 * в форе перебираем символы
 *
 * будет псевдобулевская переменная для определения когда у нас идёт слово (первый символ словили - тру, потом словили пробел - фолс и делаем +1 в переменную с кол-вом слов
 *
 * если попался пробел делаем континью
 * 
 * если попался спец символ (чтобы это понять нужно сделать типа иф чё-то там != пробел тогда заходим в иф и делаем проверку на совпадение с спецсимволом, если совпало - делаем скип основного фора
 * и т. д.
 *
 */



int main () {


    

















    return (0);
}



















